Microchip-MPLAB-Harmony/wireless_zigbee/driver/zigbee/partpacks/include/pic32cx1012bz25048_fpga.h
/**
 * \brief Header file for PIC32CX1012BZ25048_FPGA
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-10-24T22:02:23Z */
#ifndef _PIC32CX1012BZ25048_FPGA_H_
#define _PIC32CX1012BZ25048_FPGA_H_

// Header version uses Semantic Versioning 2.0.0 (https://semver.org/)
#define HEADER_FORMAT_VERSION "2.0.0"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (0)

/** \addtogroup PIC32CX1012BZ25048_FPGA_definitions PIC32CX1012BZ25048_FPGA definitions
  This file defines all structures and symbols for PIC32CX1012BZ25048_FPGA:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
 *  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_U_) || defined(_L_) || defined(_UL_)
#    error "Integer Literals macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with adding suffixes to integer literal constants for C/C++ */
#  define _U_(x) (x ## U)    /**< C code: Unsigned integer literal constant value */
#  define _L_(x) (x ## L)    /**< C code: Long integer literal constant value */
#  define _UL_(x) (x ## UL)  /**< C code: Unsigned Long integer literal constant value */

#else /* Assembler */

#  define _U_(x) x    /**< Assembler: Unsigned integer literal constant value */
#  define _L_(x) x    /**< Assembler: Long integer literal constant value */
#  define _UL_(x) x   /**< Assembler: Unsigned Long integer literal constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */
/** @}  end of Atmel Global Defines */

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR PIC32CX1012BZ25048_FPGA                            */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M4 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /**< -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /**< -14 Non Maskable Interrupt              */
  HardFault_IRQn            = -13, /**< -13 Cortex-M4 Hard Fault Interrupt      */
  MemoryManagement_IRQn     = -12, /**< -12 Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn             = -11, /**< -11 Cortex-M4 Bus Fault Interrupt       */
  UsageFault_IRQn           = -10, /**< -10 Cortex-M4 Usage Fault Interrupt     */
  SVCall_IRQn               =  -5, /**< -5  Cortex-M4 SV Call Interrupt         */
  DebugMonitor_IRQn         =  -4, /**< -4  Cortex-M4 Debug Monitor Interrupt   */
  PendSV_IRQn               =  -2, /**< -2  Cortex-M4 Pend SV Interrupt         */
  SysTick_IRQn              =  -1, /**< -1  Cortex-M4 System Tick Interrupt     */
/******  PIC32CX1012BZ25048_FPGA specific Interrupt Numbers ***********************************/
  RTC_IRQn                  =   0, /**< 0   Real-Time Counter (RTC)             */
  EIC_IRQn                  =   1, /**< 1   External Interrupt Controller (EIC) */
  FREQM_IRQn                =   2, /**< 2   Frequency Meter (FREQM)             */
  FSIB_0_IRQn               =   3, /**< 3   flash controller (FC)               */
  PORT_A_IRQn               =   4, /**< 4   GPIO (GPIOA)                        */
  PORT_B_IRQn               =   5, /**< 5   GPIO (GPIOB)                        */
  DMAC_0_3_IRQn             =   6, /**< 6   Direct Memory Access Controller (DMAC) */
  DMAC_4_15_IRQn            =   7, /**< 7   Direct Memory Access Controller (DMAC) */
  EVSYS_0_3_IRQn            =   8, /**< 8   Event System Interface (EVSYS)      */
  EVSYS_11_4_IRQn           =   9, /**< 9   Event System Interface (EVSYS)      */
  PAC_IRQn                  =  10, /**< 10  Peripheral Access Controller (PAC)  */
  RAMECC_IRQn               =  11, /**< 11  RAM ECC (RAMECC)                    */
  SERCOM0_0_IRQn            =  12, /**< 12  Serial Communication Interface (SERCOM0) */
  SERCOM1_0_IRQn            =  13, /**< 13  Serial Communication Interface (SERCOM1) */
  SERCOM2_0_IRQn            =  14, /**< 14  Serial Communication Interface (SERCOM2) */
  SERCOM3_0_IRQn            =  15, /**< 15  Serial Communication Interface (SERCOM3) */
  TCC0_0_IRQn               =  16, /**< 16  Timer Counter Control (TCC0)        */
  TCC1_0_IRQn               =  17, /**< 17  Timer Counter Control (TCC1)        */
  TCC2_0_IRQn               =  18, /**< 18  Timer Counter Control (TCC2)        */
  TC0_IRQn                  =  19, /**< 19  Basic Timer Counter (TC0)           */
  TC1_IRQn                  =  20, /**< 20  Basic Timer Counter (TC1)           */
  TC2_IRQn                  =  21, /**< 21  Basic Timer Counter (TC2)           */
  TC3_IRQn                  =  22, /**< 22  Basic Timer Counter (TC3)           */
  ADCTRL_IRQn               =  23, /**< 23  12-bit Analog to Digital Converter (ADC) */
  AC_IRQn                   =  24, /**< 24  Analog Comparators (AC)             */
  AES_IRQn                  =  25, /**< 25  Advanced Encryption Standard (AES)  */
  TRNG_IRQn                 =  26, /**< 26  True Random Generator (TRNG)        */
  ICM_IRQn                  =  27, /**< 27  Integrity Check Monitor (ICM)       */
  PUKCC_IRQn                =  28, /**< 28  PUblic-Key Cryptography Controller (PUKCC) */
  QSPI_IRQn                 =  29, /**< 29  Quad SPI interface (QSPI)           */
  ZB_INT0_IRQn              =  30, /**< 30  ZIGBEE Radio Registers (ZIGBEE)     */
  BT_INT0_IRQn              =  31, /**< 31  BLE Radio Registers (BLE)           */
  BT_INT1_IRQn              =  32, /**< 32  BLE Radio Registers (BLE)           */
  ARBITER_IRQn              =  33, /**< 33  Radio Arbiter (ARB)                 */
  ADC_FLT_IRQn              =  34, /**< 34  12-bit Analog to Digital Converter (ADC) */
  ADC_FCC_IRQn              =  35, /**< 35  12-bit Analog to Digital Converter (ADC) */
  ADC_BGVR_RDY_IRQn         =  36, /**< 36  12-bit Analog to Digital Converter (ADC) */
  CLKI_WAKEUP_NMI_IRQn      =  37, /**< 37  BLE Radio Registers (BLE)           */
  BT_LC_IRQn                =  38, /**< 38  BLE Radio Registers (BLE)           */
  BT_RC_IRQn                =  39, /**< 39  BLE Radio Registers (BLE)           */

  PERIPH_MAX_IRQn           =  39  /**< Max peripheral ID */
} IRQn_Type;
