Microchip-MPLAB-Harmony/wireless_zigbee/driver/zigbee/partpacks/include/pic32cx1012bz25048_fpga.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* Cortex-M handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non Maskable Interrupt */
  void* pfnHardFault_Handler;                    /* -13 Cortex-M4 Hard Fault Interrupt */
  void* pfnMemoryManagement_Handler;             /* -12 Cortex-M4 Memory Management Interrupt */
  void* pfnBusFault_Handler;                     /* -11 Cortex-M4 Bus Fault Interrupt */
  void* pfnUsageFault_Handler;                   /* -10 Cortex-M4 Usage Fault Interrupt */
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 Cortex-M4 SV Call Interrupt */
  void* pfnDebugMonitor_Handler;                 /*  -4 Cortex-M4 Debug Monitor Interrupt */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Cortex-M4 Pend SV Interrupt */
  void* pfnSysTick_Handler;                      /*  -1 Cortex-M4 System Tick Interrupt */

  /* Peripheral handlers */
  void* pfnRTC_Handler;                          /*   0 Real-Time Counter (RTC) */
  void* pfnEIC_Handler;                          /*   1 External Interrupt Controller (EIC) */
  void* pfnFREQM_Handler;                        /*   2 Frequency Meter (FREQM) */
  void* pfnFSIB_0_Handler;                       /*   3 flash controller (FC) */
  void* pfnPORT_A_Handler;                       /*   4 GPIO (GPIOA) */
  void* pfnPORT_B_Handler;                       /*   5 GPIO (GPIOB) */
  void* pfnDMAC_0_3_Handler;                     /*   6 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_4_15_Handler;                    /*   7 Direct Memory Access Controller (DMAC) */
  void* pfnEVSYS_0_3_Handler;                    /*   8 Event System Interface (EVSYS) */
  void* pfnEVSYS_11_4_Handler;                   /*   9 Event System Interface (EVSYS) */
  void* pfnPAC_Handler;                          /*  10 Peripheral Access Controller (PAC) */
  void* pfnRAMECC_Handler;                       /*  11 RAM ECC (RAMECC) */
  void* pfnSERCOM0_0_Handler;                    /*  12 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM1_0_Handler;                    /*  13 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM2_0_Handler;                    /*  14 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM3_0_Handler;                    /*  15 Serial Communication Interface (SERCOM3) */
  void* pfnTCC0_0_Handler;                       /*  16 Timer Counter Control (TCC0) */
  void* pfnTCC1_0_Handler;                       /*  17 Timer Counter Control (TCC1) */
  void* pfnTCC2_0_Handler;                       /*  18 Timer Counter Control (TCC2) */
  void* pfnTC0_Handler;                          /*  19 Basic Timer Counter (TC0) */
  void* pfnTC1_Handler;                          /*  20 Basic Timer Counter (TC1) */
  void* pfnTC2_Handler;                          /*  21 Basic Timer Counter (TC2) */
  void* pfnTC3_Handler;                          /*  22 Basic Timer Counter (TC3) */
  void* pfnADCTRL_Handler;                       /*  23 12-bit Analog to Digital Converter (ADC) */
  void* pfnAC_Handler;                           /*  24 Analog Comparators (AC) */
  void* pfnAES_Handler;                          /*  25 Advanced Encryption Standard (AES) */
  void* pfnTRNG_Handler;                         /*  26 True Random Generator (TRNG) */
  void* pfnICM_Handler;                          /*  27 Integrity Check Monitor (ICM) */
  void* pfnPUKCC_Handler;                        /*  28 PUblic-Key Cryptography Controller (PUKCC) */
  void* pfnQSPI_Handler;                         /*  29 Quad SPI interface (QSPI) */
  void* pfnZB_INT0_Handler;                      /*  30 ZIGBEE Radio Registers (ZIGBEE) */
  void* pfnBT_INT0_Handler;                      /*  31 BLE Radio Registers (BLE) */
  void* pfnBT_INT1_Handler;                      /*  32 BLE Radio Registers (BLE) */
  void* pfnARBITER_Handler;                      /*  33 Radio Arbiter (ARB) */
  void* pfnADC_FLT_Handler;                      /*  34 12-bit Analog to Digital Converter (ADC) */
  void* pfnADC_FCC_Handler;                      /*  35 12-bit Analog to Digital Converter (ADC) */
  void* pfnADC_BGVR_RDY_Handler;                 /*  36 12-bit Analog to Digital Converter (ADC) */
  void* pfnCLKI_WAKEUP_NMI_Handler;              /*  37 BLE Radio Registers (BLE) */
  void* pfnBT_LC_Handler;                        /*  38 BLE Radio Registers (BLE) */
  void* pfnBT_RC_Handler;                        /*  39 BLE Radio Registers (BLE) */
} DeviceVectors;

/* Defines for Deprecated Interrupt and Exceptions handler names */
#define pfnMemManage_Handler      pfnMemoryManagement_Handler     /**< \deprecated  Backward compatibility for ASF*/
#define pfnDebugMon_Handler       pfnDebugMonitor_Handler         /**< \deprecated  Backward compatibility for ASF*/
#define pfnNMI_Handler            pfnNonMaskableInt_Handler       /**< \deprecated  Backward compatibility for ASF*/
#define pfnSVC_Handler            pfnSVCall_Handler               /**< \deprecated  Backward compatibility for ASF*/

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M4 exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void MemoryManagement_Handler      ( void );
void BusFault_Handler              ( void );
void UsageFault_Handler            ( void );
void SVCall_Handler                ( void );
void DebugMonitor_Handler          ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void RTC_Handler                   ( void );
void EIC_Handler                   ( void );
void FREQM_Handler                 ( void );
void FSIB_0_Handler                ( void );
void PORT_A_Handler                ( void );
void PORT_B_Handler                ( void );
void DMAC_0_3_Handler              ( void );
void DMAC_4_15_Handler             ( void );
void EVSYS_0_3_Handler             ( void );
void EVSYS_11_4_Handler            ( void );
void PAC_Handler                   ( void );
void RAMECC_Handler                ( void );
void SERCOM0_0_Handler             ( void );
void SERCOM1_0_Handler             ( void );
void SERCOM2_0_Handler             ( void );
void SERCOM3_0_Handler             ( void );
void TCC0_0_Handler                ( void );
void TCC1_0_Handler                ( void );
void TCC2_0_Handler                ( void );
void TC0_Handler                   ( void );
void TC1_Handler                   ( void );
void TC2_Handler                   ( void );
void TC3_Handler                   ( void );
void ADCTRL_Handler                ( void );
void AC_Handler                    ( void );
void AES_Handler                   ( void );
void TRNG_Handler                  ( void );
void ICM_Handler                   ( void );
void PUKCC_Handler                 ( void );
void QSPI_Handler                  ( void );
void ZB_INT0_Handler               ( void );
void BT_INT0_Handler               ( void );
void BT_INT1_Handler               ( void );
void ARBITER_Handler               ( void );
void ADC_FLT_Handler               ( void );
void ADC_FCC_Handler               ( void );
void ADC_BGVR_RDY_Handler          ( void );
void CLKI_WAKEUP_NMI_Handler       ( void );
void BT_LC_Handler                 ( void );
void BT_RC_Handler                 ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
/* Defines for Deprecated Interrupt and Exceptions handler names */
#define MemManage_Handler         MemoryManagement_Handler        /**< \deprecated  Backward compatibility*/
#define DebugMon_Handler          DebugMonitor_Handler            /**< \deprecated  Backward compatibility*/
#define NMI_Handler               NonMaskableInt_Handler          /**< \deprecated  Backward compatibility*/
#define SVC_Handler               SVCall_Handler                  /**< \deprecated  Backward compatibility*/

