Microchip-MPLAB-Harmony/wireless_zigbee/driver/zigbee/partpacks/include/pic32cx1012bz25048_fpga.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/*
 * \brief Configuration of the CORTEX-M4 Processor and Core Peripherals
 */
#define __CM4_REV                 0x0001
#define __DEBUG_LVL                    3
#define __FPU_PRESENT                  1
#define __MPU_PRESENT                  1
#define __NVIC_PRIO_BITS               3
#define __TRACE_LVL                    2
#define __VTOR_PRESENT                 1
#define __Vendor_SysTickConfig         0

/*
 * \brief CMSIS includes
 */
#include "core_cm4.h"
#if defined USE_CMSIS_INIT
#include "system_bz25.h"
#endif /* USE_CMSIS_INIT */

/** \defgroup PIC32CX1012BZ25048_FPGA_api Peripheral Software API
 *  @{
 */

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR PIC32CX1012BZ25048_FPGA           */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/aes.h"
#include "component/ccl.h"
#include "component/cfg.h"
#include "component/cmcc.h"
#include "component/cru.h"
#include "component/dmac.h"
#include "component/dmt.h"
#include "component/dscon.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/fc.h"
#include "component/freqm.h"
#include "component/gpio.h"
#include "component/hmatrixb.h"
#include "component/icm.h"
#include "component/pac.h"
#include "component/pche.h"
#include "component/pfw.h"
#include "component/pmu.h"
#include "component/pps.h"
#include "component/pukcc.h"
#include "component/qspi.h"
#include "component/ramecc.h"
#include "component/rtc.h"
#include "component/sercom.h"
#include "component/tc.h"
#include "component/tcc.h"
#include "component/trng.h"
#include "component/wdt.h"
#include "component/arb.h"
#include "component/ble.h"
#include "component/zigbee.h"
/** @}  end of Peripheral Software API */

/** \addtogroup PIC32CX1012BZ25048_FPGA_id Peripheral Ids Definitions
 *  @{
 */

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR PIC32CX1012BZ25048_FPGA                     */
/* ************************************************************************** */
#define ID_PAC           (  0) /**< \brief Peripheral Access Controller (PAC) */
#define ID_RTC           (  9) /**< \brief Real-Time Counter (RTC) */
#define ID_EIC           ( 10) /**< \brief External Interrupt Controller (EIC) */
#define ID_FREQM         ( 11) /**< \brief Frequency Meter (FREQM) */
#define ID_SERCOM0       ( 12) /**< \brief Serial Communication Interface (SERCOM0) */
#define ID_SERCOM1       ( 13) /**< \brief Serial Communication Interface (SERCOM1) */
#define ID_TC0           ( 14) /**< \brief Basic Timer Counter (TC0) */
#define ID_TC1           ( 15) /**< \brief Basic Timer Counter (TC1) */
#define ID_DSU           ( 33) /**< \brief Device Service Unit (DSU) */
#define ID_CMCC          ( 35) /**< \brief Cortex M Cache Controller (CMCC) */
#define ID_DMAC          ( 37) /**< \brief Direct Memory Access Controller (DMAC) */
#define ID_HMATRIX       ( 38) /**< \brief HSB Matrix (HMATRIX) */
#define ID_EVSYS         ( 39) /**< \brief Event System Interface (EVSYS) */
#define ID_SERCOM2       ( 41) /**< \brief Serial Communication Interface (SERCOM2) */
#define ID_SERCOM3       ( 42) /**< \brief Serial Communication Interface (SERCOM3) */
#define ID_TCC0          ( 43) /**< \brief Timer Counter Control (TCC0) */
#define ID_TCC1          ( 44) /**< \brief Timer Counter Control (TCC1) */
#define ID_TC2           ( 45) /**< \brief Basic Timer Counter (TC2) */
#define ID_TC3           ( 46) /**< \brief Basic Timer Counter (TC3) */
#define ID_RAMECC        ( 48) /**< \brief RAM ECC (RAMECC) */
#define ID_TCC2          ( 67) /**< \brief Timer Counter Control (TCC2) */
#define ID_AC            ( 72) /**< \brief Analog Comparators (AC) */
#define ID_AES           ( 73) /**< \brief Advanced Encryption Standard (AES) */
#define ID_TRNG          ( 74) /**< \brief True Random Generator (TRNG) */
#define ID_ICM           ( 75) /**< \brief Integrity Check Monitor (ICM) */
#define ID_PUKCC         ( 76) /**< \brief PUblic-Key Cryptography Controller (PUKCC) */
#define ID_QSPI          ( 77) /**< \brief Quad SPI interface (QSPI) */
#define ID_CCL           ( 78) /**< \brief Configurable Custom Logic (CCL) */

#define ID_PERIPH_MAX    ( 78) /**< \brief Number of peripheral IDs */
/** @}  end of Peripheral Ids Definitions */

/** \addtogroup PIC32CX1012BZ25048_FPGA_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CX1012BZ25048_FPGA       */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x42001c00)                 /**< \brief AC Registers Address         */
#define ADC_REGS                         ((adc_registers_t*)0x44001400)                /**< \brief ADC Registers Address        */
#define AES_REGS                         ((aes_registers_t*)0x42000400)                /**< \brief AES Registers Address        */
#define CCL_REGS                         ((ccl_registers_t*)0x42001800)                /**< \brief CCL Registers Address        */
#define CFG_REGS                         ((cfg_registers_t*)0x44000000)                /**< \brief CFG Registers Address        */
#define CMCC_REGS                        ((cmcc_registers_t*)0x41002000)               /**< \brief CMCC Registers Address       */
#define CRU_REGS                         ((cru_registers_t*)0x44000a00)                /**< \brief CRU Registers Address        */
#define DMAC_REGS                        ((dmac_registers_t*)0x41004000)               /**< \brief DMAC Registers Address       */
#define DMT_REGS                         ((dmt_registers_t*)0x44000e00)                /**< \brief DMT Registers Address        */
#define DSCON_REGS                       ((dscon_registers_t*)0x42011000)              /**< \brief DSCON Registers Address      */
#define DSU_REGS                         ((dsu_registers_t*)0x41000000)                /**< \brief DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40000800)                /**< \brief EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x41006000)              /**< \brief EVSYS Registers Address      */
#define FC_REGS                          ((fc_registers_t*)0x44000600)                 /**< \brief FC Registers Address         */
#define FREQM_REGS                       ((freqm_registers_t*)0x40000400)              /**< \brief FREQM Registers Address      */
#define GPIOA_REGS                       ((gpio_registers_t*)0x44002200)               /**< \brief GPIOA Registers Address      */
#define GPIOB_REGS                       ((gpio_registers_t*)0x44002300)               /**< \brief GPIOB Registers Address      */
#define HMATRIX_REGS                     ((hmatrixb_registers_t*)0x42002400)           /**< \brief HMATRIX Registers Address    */
#define ICM_REGS                         ((icm_registers_t*)0x42002c00)                /**< \brief ICM Registers Address        */
#define PAC_REGS                         ((pac_registers_t*)0x40000000)                /**< \brief PAC Registers Address        */
#define PCHE_REGS                        ((pche_registers_t*)0x44012400)               /**< \brief PCHE Registers Address       */
#define PFW_REGS                         ((pfw_registers_t*)0x44000800)                /**< \brief PFW Registers Address        */
#define PMU_REGS                         ((pmu_registers_t*)0x44002e00)                /**< \brief PMU Registers Address        */
#define PPS_REGS                         ((pps_registers_t*)0x44001000)                /**< \brief PPS Registers Address        */
#define QSPI_REGS                        ((qspi_registers_t*)0x42000000)               /**< \brief QSPI Registers Address       */
#define RAMECC_REGS                      ((ramecc_registers_t*)0x41008000)             /**< \brief RAMECC Registers Address     */
#define RTC_REGS                         ((rtc_registers_t*)0x42010000)                /**< \brief RTC Registers Address        */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x40000c00)             /**< \brief SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x40001000)             /**< \brief SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x42000c00)             /**< \brief SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x42001000)             /**< \brief SERCOM3 Registers Address    */
#define TC0_REGS                         ((tc_registers_t*)0x40001400)                 /**< \brief TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x40001800)                 /**< \brief TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x40001c00)                 /**< \brief TC2 Registers Address        */
#define TC3_REGS                         ((tc_registers_t*)0x40002000)                 /**< \brief TC3 Registers Address        */
#define TCC0_REGS                        ((tcc_registers_t*)0x40002400)                /**< \brief TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x40002800)                /**< \brief TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x40002c00)                /**< \brief TCC2 Registers Address       */
#define TRNG_REGS                        ((trng_registers_t*)0x42002800)               /**< \brief TRNG Registers Address       */
#define WDT_REGS                         ((wdt_registers_t*)0x44000500)                /**< \brief WDT Registers Address        */
#define BLE_REGS                         ((ble_registers_t*)0x41012000)                /**< \brief BLE Registers Address        */
#define ZIGBEE_REGS                      ((zigbee_registers_t*)0x41010000)             /**< \brief ZIGBEE Registers Address     */
#define ARB_REGS                         ((arb_registers_t*)0x41011000)                /**< \brief ARB Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Peripheral Base Address Definitions */

/** \addtogroup PIC32CX1012BZ25048_FPGA_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CX1012BZ25048_FPGA                     */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UL_(0x42001c00)                              /**< \brief AC Base Address */
#define ADC_BASE_ADDRESS                 _UL_(0x44001400)                              /**< \brief ADC Base Address */
#define AES_BASE_ADDRESS                 _UL_(0x42000400)                              /**< \brief AES Base Address */
#define CCL_BASE_ADDRESS                 _UL_(0x42001800)                              /**< \brief CCL Base Address */
#define CFG_BASE_ADDRESS                 _UL_(0x44000000)                              /**< \brief CFG Base Address */
#define CMCC_BASE_ADDRESS                _UL_(0x41002000)                              /**< \brief CMCC Base Address */
#define CRU_BASE_ADDRESS                 _UL_(0x44000a00)                              /**< \brief CRU Base Address */
#define DMAC_BASE_ADDRESS                _UL_(0x41004000)                              /**< \brief DMAC Base Address */
#define DMT_BASE_ADDRESS                 _UL_(0x44000e00)                              /**< \brief DMT Base Address */
#define DSCON_BASE_ADDRESS               _UL_(0x42011000)                              /**< \brief DSCON Base Address */
#define DSU_BASE_ADDRESS                 _UL_(0x41000000)                              /**< \brief DSU Base Address */
#define EIC_BASE_ADDRESS                 _UL_(0x40000800)                              /**< \brief EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UL_(0x41006000)                              /**< \brief EVSYS Base Address */
#define FC_BASE_ADDRESS                  _UL_(0x44000600)                              /**< \brief FC Base Address */
#define FREQM_BASE_ADDRESS               _UL_(0x40000400)                              /**< \brief FREQM Base Address */
#define GPIOA_BASE_ADDRESS               _UL_(0x44002200)                              /**< \brief GPIOA Base Address */
#define GPIOB_BASE_ADDRESS               _UL_(0x44002300)                              /**< \brief GPIOB Base Address */
#define HMATRIX_BASE_ADDRESS             _UL_(0x42002400)                              /**< \brief HMATRIX Base Address */
#define ICM_BASE_ADDRESS                 _UL_(0x42002c00)                              /**< \brief ICM Base Address */
#define PAC_BASE_ADDRESS                 _UL_(0x40000000)                              /**< \brief PAC Base Address */
#define PCHE_BASE_ADDRESS                _UL_(0x44012400)                              /**< \brief PCHE Base Address */
#define PFW_BASE_ADDRESS                 _UL_(0x44000800)                              /**< \brief PFW Base Address */
#define PMU_BASE_ADDRESS                 _UL_(0x44002e00)                              /**< \brief PMU Base Address */
#define PPS_BASE_ADDRESS                 _UL_(0x44001000)                              /**< \brief PPS Base Address */
#define QSPI_BASE_ADDRESS                _UL_(0x42000000)                              /**< \brief QSPI Base Address */
#define RAMECC_BASE_ADDRESS              _UL_(0x41008000)                              /**< \brief RAMECC Base Address */
#define RTC_BASE_ADDRESS                 _UL_(0x42010000)                              /**< \brief RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UL_(0x40000c00)                              /**< \brief SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UL_(0x40001000)                              /**< \brief SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UL_(0x42000c00)                              /**< \brief SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UL_(0x42001000)                              /**< \brief SERCOM3 Base Address */
#define TC0_BASE_ADDRESS                 _UL_(0x40001400)                              /**< \brief TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UL_(0x40001800)                              /**< \brief TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UL_(0x40001c00)                              /**< \brief TC2 Base Address */
#define TC3_BASE_ADDRESS                 _UL_(0x40002000)                              /**< \brief TC3 Base Address */
#define TCC0_BASE_ADDRESS                _UL_(0x40002400)                              /**< \brief TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UL_(0x40002800)                              /**< \brief TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UL_(0x40002c00)                              /**< \brief TCC2 Base Address */
#define TRNG_BASE_ADDRESS                _UL_(0x42002800)                              /**< \brief TRNG Base Address */
#define WDT_BASE_ADDRESS                 _UL_(0x44000500)                              /**< \brief WDT Base Address */
#define BLE_BASE_ADDRESS                 _UL_(0x41012000)                              /**< \brief BLE Base Address */
#define ZIGBEE_BASE_ADDRESS              _UL_(0x41010000)                              /**< \brief ZIGBEE Base Address */
#define ARB_BASE_ADDRESS                 _UL_(0x41011000)                              /**< \brief ARB Base Address */
/** @}  end of Peripheral Base Address Definitions */

/** \addtogroup PIC32CX1012BZ25048_FPGA_pio Peripheral Pio Definitions
 *  @{
 */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR PIC32CX1012BZ25048_FPGA                              */
/* ************************************************************************** */
#include "pio/pic32cx1012bz25048_fpga.h"
/** @}  end of Peripheral Pio Definitions */

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR PIC32CX1012BZ25048_FPGA                   */
/* ************************************************************************** */

#define CMCC_SIZE                      _UL_(0x01000000)    /* 16384kB Memory segment type: io */
#define CMCC_DATARAM_SIZE              _UL_(0x00001000)    /*    4kB Memory segment type: io */
#define CMCC_TAGRAM_SIZE               _UL_(0x00000400)    /*    1kB Memory segment type: io */
#define CMCC_VALIDRAM_SIZE             _UL_(0x00000040)    /*    0kB Memory segment type: io */
#define HSRAM_SIZE                     _UL_(0x00020000)    /*  128kB Memory segment type: ram */
#define HSRAM_ETB_SIZE                 _UL_(0x00008000)    /*   32kB Memory segment type: ram */
#define HSRAM_RET1_SIZE                _UL_(0x00008000)    /*   32kB Memory segment type: ram */
#define HPB0_SIZE                      _UL_(0x00003000)    /*   12kB Memory segment type: io */
#define HPB1_SIZE                      _UL_(0x00015000)    /*   84kB Memory segment type: io */
#define HPB2_SIZE                      _UL_(0x00002400)    /*    9kB Memory segment type: io */
#define HPB3_SIZE                      _UL_(0x00003000)    /*   12kB Memory segment type: io */
#define BKUPRAM_SIZE                   _UL_(0x00002000)    /*    8kB Memory segment type: ram */
#define FLASH_SIZE                     _UL_(0x00100000)    /* 1024kB Memory segment type: flash */
#define FLASH_PAGE_SIZE                _UL_(      4096)
#define FLASH_NB_OF_PAGES              _UL_(       256)

#define PPB_SIZE                       _UL_(0x00100000)    /* 1024kB Memory segment type: io */
#define QSPI_SIZE                      _UL_(0x01000000)    /* 16384kB Memory segment type: other */
#define SCS_SIZE                       _UL_(0x00001000)    /*    4kB Memory segment type: io */
#define BOOT_FLASH_SIZE                _UL_(0x00005000)    /*   20kB Memory segment type: flash */
#define BOOT_FLASH_PAGE_SIZE           _UL_(      4096)
#define BOOT_FLASH_NB_OF_PAGES         _UL_(         5)

#define CFG_FLASH_SIZE                 _UL_(0x00001000)    /*    4kB Memory segment type: flash */
#define CFG_FLASH_PAGE_SIZE            _UL_(      4096)
#define CFG_FLASH_NB_OF_PAGES          _UL_(         1)

#define OTP_FLASH_SIZE                 _UL_(0x00001000)    /*    4kB Memory segment type: flash */
#define OTP_FLASH_PAGE_SIZE            _UL_(      4096)
#define OTP_FLASH_NB_OF_PAGES          _UL_(         1)


#define CMCC_ADDR                      _UL_(0x03000000)    /**< CMCC base address (type: io)*/
#define CMCC_DATARAM_ADDR              _UL_(0x03000000)    /**< CMCC_DATARAM base address (type: io)*/
#define CMCC_TAGRAM_ADDR               _UL_(0x03001000)    /**< CMCC_TAGRAM base address (type: io)*/
#define CMCC_VALIDRAM_ADDR             _UL_(0x03002000)    /**< CMCC_VALIDRAM base address (type: io)*/
#define HSRAM_ADDR                     _UL_(0x20000000)    /**< HSRAM base address (type: ram)*/
#define HSRAM_ETB_ADDR                 _UL_(0x20000000)    /**< HSRAM_ETB base address (type: ram)*/
#define HSRAM_RET1_ADDR                _UL_(0x20000000)    /**< HSRAM_RET1 base address (type: ram)*/
#define HPB0_ADDR                      _UL_(0x40000000)    /**< HPB0 base address (type: io)*/
#define HPB1_ADDR                      _UL_(0x41000000)    /**< HPB1 base address (type: io)*/
#define HPB2_ADDR                      _UL_(0x42000000)    /**< HPB2 base address (type: io)*/
#define HPB3_ADDR                      _UL_(0x44000000)    /**< HPB3 base address (type: io)*/
#define BKUPRAM_ADDR                   _UL_(0x44014000)    /**< BKUPRAM base address (type: ram)*/
#define FLASH_ADDR                     _UL_(0x01000000)    /**< FLASH base address (type: flash)*/
#define PPB_ADDR                       _UL_(0xe0000000)    /**< PPB base address (type: io)*/
#define QSPI_ADDR                      _UL_(0x04000000)    /**< QSPI base address (type: other)*/
#define SCS_ADDR                       _UL_(0xe000e000)    /**< SCS base address (type: io)*/
#define BOOT_FLASH_ADDR                _UL_(0x00000000)    /**< BOOT_FLASH base address (type: flash)*/
#define CFG_FLASH_ADDR                 _UL_(0x00005000)    /**< CFG_FLASH base address (type: flash)*/
#define OTP_FLASH_ADDR                 _UL_(0x00006000)    /**< OTP_FLASH base address (type: flash)*/

/* ************************************************************************** */
/**  DEVICE SIGNATURES FOR PIC32CX1012BZ25048_FPGA                            */
/* ************************************************************************** */
#define CHIP_JTAGID                    _UL_(0X09B8F053)
#define DSU_DID                        _UL_(0X00009B8F)

/* ************************************************************************** */
/**  ELECTRICAL DEFINITIONS FOR PIC32CX1012BZ25048_FPGA                       */
/* ************************************************************************** */

